Revit 2027 API
AnalyticalLinkType.RotationZ Property
 Fixity of rotation around Z.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalyticalFixityState RotationZ { get; set; }
Public Property RotationZ As AnalyticalFixityState
	Get
	Set
public:
property AnalyticalFixityState RotationZ {
	AnalyticalFixityState get ();
	void set (AnalyticalFixityState value);
}
member RotationZ : AnalyticalFixityState with get, set
Property Value
AnalyticalFixityState
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The fixity state rotationZ is not valid for Analytical Link Type parameters.
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
AnalyticalLinkType Class
Autodesk.Revit.DB.Structure Namespace